tap "buildpacks/tap"
tap "github/bootstrap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "act"
brew "openssl@3"
brew "glib"
brew "at-spi2-core"
brew "autoconf"
brew "automake"
brew "python@3.11", link: false
brew "awscli"
brew "azure-cli"
brew "buf"
brew "pycparser"
brew "cffi"
brew "cmake"
brew "coreutils"
brew "docker", link: false
brew "docker-compose", link: false
brew "docker-machine"
brew "docutils"
brew "gdk-pixbuf"
brew "gh"
brew "git-lfs"
brew "gnu-sed"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libksba"
brew "gnupg"
brew "gobject-introspection"
brew "golangci-lint"
brew "grpcurl"
brew "gsettings-desktop-schemas"
brew "harfbuzz"
brew "openssl@1.1"
brew "pango"
brew "python@3.9"
brew "gtk+3"
brew "gtk-mac-integration"
brew "guile"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "launchdns"
brew "libssh"
brew "nghttp2"
brew "nginx", restart_service: true
brew "nmap"
brew "node"
brew "pinentry-mac"
brew "podman"
brew "protobuf"
brew "python@3.10"
brew "python@3.7"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "shared-mime-info"
brew "terraform"
brew "tmux"
brew "trufflehog"
brew "watch"
brew "zlib"
brew "zsh"
brew "buildpacks/tap/pack"
cask "1password"
cask "1password-cli"
cask "altair-graphql-client"
cask "bitwarden"
cask "cameracontroller"
cask "db-browser-for-sqlite"
cask "firefox"
cask "firefox@developer-edition"
cask "gimp"
cask "google-chrome"
cask "hashicorp-vagrant"
cask "iterm2"
cask "kitty"
cask "macfuse"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "vagrant"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
vscode "42crunch.vscode-openapi"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "coolbear.systemd-unit-file"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "fabiospampinato.vscode-diff"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "jasonnutter.vscode-codeowners"
vscode "jock.svg"
vscode "mads-hartmann.bash-ide-vscode"
vscode "maxmedia.go-prof"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "peterj.proto"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sleistner.vscode-fileutils"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "wingrunr21.vscode-ruby"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
